{
  "id": 1,
  "title": "Day 1",
  "date": "2024-03-24T09:00:00+09:00",
  "schedules": [
    {
      "time": "2024-03-24T09:30:00+09:00",
      "sessions": [
        {
          "title": "Registration",
          "summary": "Sign in with Luma and show QR code of your ticket at the reception."
        }
      ]
    },
    {
      "time": "2024-03-24T10:00:00+09:00",
      "sessions": [
        {
          "title": "The Composable Architecture",
          "speakers": [
            {
              "id": 9,
              "name": "Brandon Williams",
              "image_name": "Brandon Williams",
              "bio": "Brandon spent a long time doing mathematics, but now likes to teach programming with a nod towards math. He co-hosts a video series called Point-Free, which focuses on the Swift language and how to best make use of its type system and features.",
              "links": [
                {
                  "url": "https://twitter.com/mbrandonw",
                  "name": "@mbrandonw"
                }
              ]
            },
            {
              "id": 10,
              "name": "Stephen Celis",
              "image_name": "Stephen Celis",
              "bio": "Stephen entered tech by way of a liberal arts degree. He now works on Point-Free with Brandon Williams, where he tries to spread the word of testable, composable app development.",
              "links": [
                {
                  "url": "https://github.com/stephencelis",
                  "name": "@stephencelis"
                }
              ]
            }
          ],
          "description": "Brandon and Stephen, maintainers of the Composable Architecture, will give a broad overview of the library and demonstrate its core tenets: concise domain modeling with value types, composition of features, dependency management, and testability. We will do this by building a very simple application from scratch, and increasingly adding on more complex features."
        },
        {
          "title": "Swift, Swift Data, and SwiftData",
          "speakers": [
            {
              "id": 6,
              "name": "Paul Hudson",
              "image_name": "paul_hudson",
              "bio": "Paul is the author of Hacking with Swift, Pro Swift, Swift Design Patterns, Testing Swift, Swift Coding Challenges, and more. Suffice it to say, he quite likes Swift. And coffee. (But mostly Swift.) (And coffee.)",
              "links": [
                {
                  "url": "https://twitter.com/twostraws",
                  "name": "@twostraws"
                }
              ]
            }
          ],
          "description": "In this workshop we'll walk through how Swift's new Observable system is revolutionizing the way we write SwiftUI code, then move on to explore how it's used inside the SwiftData framework make app storage easier than ever. Please come with the latest Xcode installed on your laptop, because this is a hands-on workshop and you'll be expected to write a lot of code."
        },
        {
          "title": "Getting Started with Vapor",
          "speakers": [
            {
              "id": 8,
              "name": "Tim Condon",
              "image_name": "Tim Condon",
              "bio": "Tim is a Swift developer from Manchester, UK and part of the Vapor Core Team. He's part of the server-side Swift team at Kodeco and has written the unofficial-official book on Vapor with the founders of the framework. He founded Broken Hands a few years ago and delivers talks and workshops on Vapor and server-side Swift around the world. He also co-organises the ServerSide.swift conference - the world’s first and only conference focused on server-side Swift.",
              "links": [
                {
                  "url": "https://hachyderm.io/@0xTim",
                  "name": "@0xTim"
                }
              ]
            }
          ],
          "description": "In this workshop you'll learn everything you need to build a simple Vapor application. You'll learn how to create routes, saves models to a database and build REST APIs. This workshop is fully updated for async/await!"
        },
        {
          "title": "Getting started with controlling LEGO using Swift",
          "speakers": [
            {
              "name": "Hiromu Tsuruta",
              "image_name": "Hiromu Tsuruta",
              "bio": "Hiromu is a member of Rakuten Group, Inc. and is involved in the development of Rakuten Rakuma as an iOS engineer and tech lead.",
              "links": [
                {
                  "name": "@hcrane14",
                  "url": "https://twitter.com/hcrane14"
                }
              ]
            },
            {
              "name": "Shinichiro Oba",
              "image_name": "Shinichiro Oba",
              "bio": "Shinichiro is a software engineer and works on improvements of DevOps and DevEx in various teams. He also contributes some open-sourced swift projects.",
              "links": [
                {
                  "name": "@ooba",
                  "url": "https://twitter.com/ooba"
                }
              ]
            }
          ],
          "description": "In this workshop, we'll learn how to control Bluetooth Low Energy devices such as LEGO using Swift and Core Bluetooth.\n\nFirst, we'll deepen our understanding of controlling Bluetooth Low Energy (BLE) devices with Swift. After learning an overview of BLE and how to use Core Bluetooth, we will conduct a demonstration using the STAR WARS R2-D2 droid kit provided by littleBits.\n\nNext, we'll learn about the LEGO Wireless Protocol, which is the protocol for controlling LEGO via BLE. Finally, we'll utilize LEGO kits to create something that moves together.\n\nNote : Please note that the number of kits is limited, so if there are many participants, we'll form teams to conduct the workshop."
        },
        {
          "title": "Unique to Apple Vision Pro! How to Start Developing Spatial Apps",
          "speakers": [
            {
              "name": "Kazuya Hiruma",
              "image_name": "Kazuya Hiruma",
              "bio": "Kazuya worked as a web engineer leader at Kayac, and then fell in love with 3DCG and VR, and moved to the VR team at COLOPL, where he worked as a lead engineer for the development of the VR game \"Nyoro The Snake & Seven Islands\" and experienced developing many VR games. After joining MESON, he worked as an XR engineer before becoming CTO.",
              "links": [
                {
                  "name": "@edom18",
                  "url": "https://github.com/edom18"
                }
              ]
            },
            {
              "name": "Hisaki Sato",
              "image_name": "Hisaki Sato",
              "bio": "Hisaki joined Konami Digital Entertainment and was involved in the online implementation of Winning Eleven for 5 years, developed and operated apps as an engineer at COLOPL for 9 years, developed AR games using location information and AR, and VR games such as OculusRift and PSVR After his experience in development, he joined MESON. He is developing SunnyTune, a launch title for VisionPro at MESON.",
              "links": [
                {
                  "name": "@lorincho3",
                  "url": "https://twitter.com/lorincho3"
                }
              ]
            }
          ],
          "description": "You will learn how MESON's launch title for Apple Vision Pro is made with hands-on experience.\n\nWe will also talk a bit about how we develop in Unity (PolySpatial).",
          "requirements": "Latest Xcode, Unity if needed and Apple Vision Pro (if you have, not required)"
        }
      ]
    },
    {
      "time": "2024-03-24T12:00:00+09:00",
      "sessions": [
        {
          "title": "Lunch",
          "summary": "Please enjoy the meal and have a chat with other attendees."
        }
      ]
    },
    {
      "time": "2024-03-24T13:00:00+09:00",
      "sessions": [
        {
          "title": "Open Source Swift Workshop",
          "speakers": [
            {
              "name": "giginet",
              "image_name": "giginet",
              "bio": "giginet works at LY Corp to improve Developer Experience for LINE. He also contributes some open-sourced developer tools like fastlane, Carthage, XcodeGen, and so on.",
              "links": [
                {
                  "url": "https://twitter.com/giginet",
                  "name": "@giginet"
                }
              ]
            },
            {
              "name": "Yusuke Kita",
              "image_name": "Yusuke Kita",
              "bio": "He is a software engineer and works on improvements of DevOps and DevEx in various teams. He also contributes some open-sourced swift projects.",
              "links": [
                {
                  "url": "https://twitter.com/kitasuke",
                  "name": "@kitasuke"
                }
              ]
            },
            {
              "name": "ikesyo",
              "image_name": "ikesyo",
              "bio": "ikesyo is a Swift (corelibs-foundation) contributor. He was also the author or maintainer of projects such as Himotoki, Quick, Nimble, Carthage, and ReactiveSwift. He is currently developing various manga apps at Hatena Co., Ltd.",
              "links": [
                {
                  "url": "https://twitter.com/ikesyo",
                  "name": "@ikesyo"
                }
              ]
            }
          ],
          "description": "In this workshop we will look at the Swift compilation process and what those parts are, learn a bit about LLVM, how to find a bug to work on using bugs.swift.org and then making a build with our changes and running tests.A merged pull request is not the goal of this workshop, but after attending this workshop you should have enough knowledge to get started and know where to look to learn more.\n\nIf you are proficient in C++ or even have some experience with LLVM, then you can start working with the Swift compiler right away.\n\nIf you do not have former C++ knowledge fear not, the Swift standard library or SwiftSyntax are written mostly in Swift and the python / swift hybrid '.gyb' files.\nIn addition, we’re welcome to contribute to any other Swift family projects, like Foundation, Swift Package Manager, or any other first-party libraries.",
          "requirements": "Laptops with the latest stable Xcode and building the Swift compiler is preferred. Instruction will be provided beforehand."
        },
        {
          "title": "Peer Labs",
          "summary": "Peer Labs is your chance to get hands on with things you learned from try! Swift presentations, discuss any issues with the speakers, connect with your peers, work on open source projects, organize impromptu learning sessions and more! Peer labs do not have a strict structure, and are open-ended instead. It is what you and your peers make of it! We will ask everyone to introduce themselves in the beginning, and then it is up to you to ask questions and work together with others on projects that interest you."
        }
      ]
    },
    {
      "time": "2024-03-24T16:30:00+09:00",
      "sessions": [
        {
          "title": "Close"
        }
      ]
    }
  ]
}
